lamlamngo/onewire-slave-emulator/lib/include/pic24_ports_mapping.h
/*
 * "Copyright (c) 2017 Robert B. Reese, Bryan A. Jones, J. W. Bruce ("AUTHORS")"
 * All rights reserved.
 * (R. Reese, reese_AT_ece.msstate.edu, Mississippi State University)
 * (B. A. Jones, bjones_AT_ece.msstate.edu, Mississippi State University)
 * (J. W. Bruce, jwbruce_AT_ece.msstate.edu, Mississippi State University)
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement is
 * hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the authors appear in all copies of this software.
 *
 * IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
 * HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
 *
 * Please maintain this header in its entirety when copying/modifying
 * these files.
 *
 *
 */

/// \file
/// \brief Define device-specific mappings from Rxy to RPy, ANn, and CNm pins.

#if 0

#elif defined(__PIC24EP128GP202__) || \
      defined(__PIC24EP128MC202__) || \
      defined(__PIC24EP256GP202__) || \
      defined(__PIC24EP256MC202__) || \
      defined(__PIC24EP32GP202__) || \
      defined(__PIC24EP32MC202__) || \
      defined(__PIC24EP512GP202__) || \
      defined(__PIC24EP512MC202__) || \
      defined(__PIC24EP64GP202__) || \
      defined(__PIC24EP64MC202__) || \
      defined(__dsPIC33EP128GP502__) || \
      defined(__dsPIC33EP128MC202__) || \
      defined(__dsPIC33EP128MC502__) || \
      defined(__dsPIC33EP256GP502__) || \
      defined(__dsPIC33EP256MC202__) || \
      defined(__dsPIC33EP256MC502__) || \
      defined(__dsPIC33EP32GP502__) || \
      defined(__dsPIC33EP32MC202__) || \
      defined(__dsPIC33EP32MC502__) || \
      defined(__dsPIC33EP512GP502__) || \
      defined(__dsPIC33EP512MC202__) || \
      defined(__dsPIC33EP512MC502__) || \
      defined(__dsPIC33EP64GP502__) || \
      defined(__dsPIC33EP64MC202__) || \
      defined(__dsPIC33EP64MC502__)
# define RA0_AN 0
# define RA1_AN 1
# define RA4_RP 20
# define RB0_RP 32
# define RB0_AN 2
# define RB1_RP 33
# define RB1_AN 3
# define RB2_RP 34
# define RB2_AN 4
# define RB3_RP 35
# define RB3_AN 5
# define RB4_RP 36
# define RB5_RP 37
# define RB6_RP 38
# define RB7_RP 39
# define RB8_RP 40
# define RB9_RP 41
# define RB10_RP 42
# define RB11_RP 43
# define RB12_RP 44
# define RB13_RP 45
# define RB14_RP 46
# define RB15_RP 47

#elif defined(__PIC24EP128GP204__) || \
      defined(__PIC24EP128MC204__) || \
      defined(__PIC24EP256GP204__) || \
      defined(__PIC24EP256MC204__) || \
      defined(__PIC24EP32GP204__) || \
      defined(__PIC24EP32MC204__) || \
      defined(__PIC24EP512GP204__) || \
      defined(__PIC24EP512MC204__) || \
      defined(__PIC24EP64GP204__) || \
      defined(__PIC24EP64MC204__) || \
      defined(__dsPIC33EP128GP504__) || \
      defined(__dsPIC33EP128MC204__) || \
      defined(__dsPIC33EP128MC504__) || \
      defined(__dsPIC33EP256GP504__) || \
      defined(__dsPIC33EP256MC204__) || \
      defined(__dsPIC33EP256MC504__) || \
      defined(__dsPIC33EP32GP504__) || \
      defined(__dsPIC33EP32MC204__) || \
      defined(__dsPIC33EP32MC504__) || \
      defined(__dsPIC33EP512GP504__) || \
      defined(__dsPIC33EP512MC204__) || \
      defined(__dsPIC33EP512MC504__) || \
      defined(__dsPIC33EP64GP504__) || \
      defined(__dsPIC33EP64MC204__) || \
      defined(__dsPIC33EP64MC504__)
# define RA0_AN 0
# define RA1_AN 1
# define RA4_RP 20
# define RA8_RP 24
# define RA9_RP 25
# define RB0_RP 32
# define RB0_AN 2
# define RB1_RP 33
# define RB1_AN 3
# define RB2_RP 34
# define RB2_AN 4
# define RB3_RP 35
# define RB3_AN 5
# define RB4_RP 36
# define RB5_RP 37
# define RB6_RP 38
# define RB7_RP 39
# define RB8_RP 40
# define RB9_RP 41
# define RB10_RP 42
# define RB11_RP 43
# define RB12_RP 44
# define RB13_RP 45
# define RB14_RP 46
# define RB15_RP 47
# define RC0_AN 6
# define RC1_AN 7
# define RC2_AN 8
# define RC3_RP 51
# define RC4_RP 52
# define RC5_RP 53
# define RC6_RP 54
# define RC7_RP 55
# define RC8_RP 56
# define RC9_RP 57

#elif defined(__PIC24EP128GP206__) || \
      defined(__PIC24EP128MC206__) || \
      defined(__PIC24EP256GP206__) || \
      defined(__PIC24EP256MC206__) || \
      defined(__PIC24EP512GP206__) || \
      defined(__PIC24EP512MC206__) || \
      defined(__PIC24EP64GP206__) || \
      defined(__PIC24EP64MC206__) || \
      defined(__dsPIC33EP128GP506__) || \
      defined(__dsPIC33EP128MC206__) || \
      defined(__dsPIC33EP128MC506__) || \
      defined(__dsPIC33EP256GP506__) || \
      defined(__dsPIC33EP256MC206__) || \
      defined(__dsPIC33EP256MC506__) || \
      defined(__dsPIC33EP512GP506__) || \
      defined(__dsPIC33EP512MC206__) || \
      defined(__dsPIC33EP512MC506__) || \
      defined(__dsPIC33EP64GP506__) || \
      defined(__dsPIC33EP64MC206__) || \
      defined(__dsPIC33EP64MC506__)
# define RA0_AN 0
# define RA1_AN 1
# define RA4_RP 20
# define RA8_RP 24
# define RA9_RP 25
# define RA11_RP 27
# define RA11_AN 9
# define RA12_RP 28
# define RA12_AN 10
# define RB0_RP 32
# define RB0_AN 2
# define RB1_RP 33
# define RB1_AN 3
# define RB2_RP 34
# define RB2_AN 4
# define RB3_RP 35
# define RB3_AN 5
# define RB4_RP 36
# define RB5_RP 37
# define RB6_RP 38
# define RB7_RP 39
# define RB8_RP 40
# define RB9_RP 41
# define RB10_RP 42
# define RB11_RP 43
# define RB12_RP 44
# define RB13_RP 45
# define RB14_RP 46
# define RB15_RP 47
# define RC0_AN 6
# define RC1_AN 7
# define RC2_AN 8
# define RC3_RP 51
# define RC4_RP 52
# define RC5_RP 53
# define RC6_RP 54
# define RC7_RP 55
# define RC8_RP 56
# define RC9_RP 57
# define RC10_RP 58
# define RC11_AN 11
# define RE12_AN 12
# define RE13_AN 13
# define RE14_RP 94
# define RE14_AN 14
# define RE15_RP 95
# define RE15_AN 15
# define RF0_RP 96
# define RF1_RP 97
# define RG6_RP 118
# define RG7_RP 119
# define RG8_RP 120
# define RG9_RP 121

#elif defined(__PIC24EP256GU810__) || \
      defined(__PIC24EP512GU810__)
# define RA0_RP 16
# define RA1_RP 17
# define RA2_RP 18
# define RA3_RP 19
# define RA4_RP 20
# define RA5_RP 21
# define RA6_RP 22
# define RA6_AN 22
# define RA7_RP 23
# define RA7_AN 23
# define RA14_RP 30
# define RA15_RP 31
# define RB0_RP 32
# define RB0_AN 0
# define RB1_RP 33
# define RB1_AN 1
# define RB2_RP 34
# define RB2_AN 2
# define RB3_RP 35
# define RB3_AN 3
# define RB4_RP 36
# define RB4_AN 4
# define RB5_RP 37
# define RB5_AN 5
# define RB6_RP 38
# define RB6_AN 6
# define RB7_RP 39
# define RB7_AN 7
# define RB8_RP 40
# define RB8_AN 8
# define RB9_RP 41
# define RB9_AN 9
# define RB10_RP 42
# define RB10_AN 10
# define RB11_RP 43
# define RB11_AN 11
# define RB12_RP 44
# define RB12_AN 12
# define RB13_RP 45
# define RB13_AN 13
# define RB14_RP 46
# define RB14_AN 14
# define RB15_RP 47
# define RB15_AN 15
# define RC1_RP 49
# define RC1_AN 16
# define RC2_RP 50
# define RC2_AN 17
# define RC3_RP 51
# define RC3_AN 18
# define RC4_RP 52
# define RC4_AN 19
# define RC12_RP 60
# define RC13_RP 61
# define RC14_RP 62
# define RD0_RP 64
# define RD1_RP 65
# define RD2_RP 66
# define RD3_RP 67
# define RD4_RP 68
# define RD5_RP 69
# define RD6_RP 70
# define RD7_RP 71
# define RD8_RP 72
# define RD9_RP 73
# define RD10_RP 74
# define RD11_RP 75
# define RD12_RP 76
# define RD13_RP 77
# define RD14_RP 78
# define RD15_RP 79
# define RE0_RP 80
# define RE0_AN 24
# define RE1_RP 81
# define RE1_AN 25
# define RE2_RP 82
# define RE2_AN 26
# define RE3_RP 83
# define RE3_AN 27
# define RE4_RP 84
# define RE4_AN 28
# define RE5_RP 85
# define RE5_AN 29
# define RE6_RP 86
# define RE6_AN 30
# define RE7_RP 87
# define RE7_AN 31
# define RE8_RP 88
# define RE8_AN 20
# define RE9_RP 89
# define RE9_AN 21
# define RF0_RP 96
# define RF1_RP 97
# define RF2_RP 98
# define RF3_RP 99
# define RF4_RP 100
# define RF5_RP 101
# define RF12_RP 108
# define RF13_RP 109
# define RG0_RP 112
# define RG1_RP 113
# define RG6_RP 118
# define RG7_RP 119
# define RG8_RP 120
# define RG9_RP 121
# define RG12_RP 124
# define RG13_RP 125
# define RG14_RP 126
# define RG15_RP 127

#elif defined(__PIC24EP256GU814__) || \
      defined(__PIC24EP512GU814__) || \
      defined(__dsPIC33EP256MU810__) || \
      defined(__dsPIC33EP256MU814__) || \
      defined(__dsPIC33EP512MU810__) || \
      defined(__dsPIC33EP512MU814__)
# define RA0_RP 16
# define RA1_RP 17
# define RA2_RP 18
# define RA3_RP 19
# define RA4_RP 20
# define RA5_RP 21
# define RA6_RP 22
# define RA6_AN 22
# define RA7_RP 23
# define RA7_AN 23
# define RA14_RP 30
# define RA15_RP 31
# define RB0_RP 32
# define RB0_AN 0
# define RB1_RP 33
# define RB1_AN 1
# define RB2_RP 34
# define RB2_AN 2
# define RB3_RP 35
# define RB3_AN 3
# define RB4_RP 36
# define RB4_AN 4
# define RB5_RP 37
# define RB5_AN 5
# define RB6_RP 38
# define RB6_AN 6
# define RB7_RP 39
# define RB7_AN 7
# define RB8_RP 40
# define RB8_AN 8
# define RB9_RP 41
# define RB9_AN 9
# define RB10_RP 42
# define RB10_AN 10
# define RB11_RP 43
# define RB11_AN 11
# define RB12_RP 44
# define RB12_AN 12
# define RB13_RP 45
# define RB13_AN 13
# define RB14_RP 46
# define RB14_AN 14
# define RB15_RP 47
# define RB15_AN 15
# define RC1_RP 49
# define RC1_AN 16
# define RC2_RP 50
# define RC2_AN 17
# define RC3_RP 51
# define RC3_AN 18
# define RC4_RP 52
# define RC4_AN 19
# define RC12_RP 60
# define RC13_RP 61
# define RC14_RP 62
# define RD0_RP 64
# define RD1_RP 65
# define RD2_RP 66
# define RD3_RP 67
# define RD4_RP 68
# define RD5_RP 69
# define RD6_RP 70
# define RD7_RP 71
# define RD8_RP 72
# define RD9_RP 73
# define RD10_RP 74
# define RD11_RP 75
# define RD12_RP 76
# define RD13_RP 77
# define RD14_RP 78
# define RD15_RP 79
# define RE0_RP 80
# define RE0_AN 24
# define RE1_RP 81
# define RE1_AN 25
# define RE2_RP 82
# define RE2_AN 26
# define RE3_RP 83
# define RE3_AN 27
# define RE4_RP 84
# define RE4_AN 28
# define RE5_RP 85
# define RE5_AN 29
# define RE6_RP 86
# define RE6_AN 30
# define RE7_RP 87
# define RE7_AN 31
# define RE8_RP 88
# define RE8_AN 20
# define RE9_RP 89
# define RE9_AN 21
# define RF0_RP 96
# define RF1_RP 97
# define RF2_RP 98
# define RF3_RP 99
# define RF4_RP 100
# define RF5_RP 101
# define RF8_RP 104
# define RF12_RP 108
# define RF13_RP 109
# define RG0_RP 112
# define RG1_RP 113
# define RG6_RP 118
# define RG7_RP 119
# define RG8_RP 120
# define RG9_RP 121
# define RG12_RP 124
# define RG13_RP 125
# define RG14_RP 126
# define RG15_RP 127

