lamlamngo/onewire-slave-emulator/lib/include/pic24_ports_mapping.h
#elif defined(__PIC24EP32GP203__) || \
      defined(__PIC24EP32MC203__) || \
      defined(__PIC24EP64GP203__) || \
      defined(__PIC24EP64MC203__) || \
      defined(__dsPIC33EP32GP503__) || \
      defined(__dsPIC33EP32MC203__) || \
      defined(__dsPIC33EP32MC503__) || \
      defined(__dsPIC33EP64GP503__) || \
      defined(__dsPIC33EP64MC203__) || \
      defined(__dsPIC33EP64MC503__)
# define RA0_AN 0
# define RA1_AN 1
# define RA4_RP 20
# define RA8_RP 24
# define RB0_RP 32
# define RB0_AN 2
# define RB1_RP 33
# define RB1_AN 3
# define RB2_RP 34
# define RB2_AN 4
# define RB3_RP 35
# define RB3_AN 5
# define RB4_RP 36
# define RB5_RP 37
# define RB6_RP 38
# define RB7_RP 39
# define RB8_RP 40
# define RB9_RP 41
# define RB10_RP 42
# define RB11_RP 43
# define RB12_RP 44
# define RB13_RP 45
# define RB14_RP 46
# define RB15_RP 47
# define RC0_AN 6
# define RC1_AN 7
# define RC8_RP 56

#elif defined(__PIC24EP512GP806__) || \
      defined(__dsPIC33EP512GP806__) || \
      defined(__dsPIC33EP512MC806__)
# define RB0_RP 32
# define RB0_AN 0
# define RB1_RP 33
# define RB1_AN 1
# define RB2_RP 34
# define RB2_AN 2
# define RB3_RP 35
# define RB3_AN 3
# define RB4_RP 36
# define RB4_AN 4
# define RB5_RP 37
# define RB5_AN 5
# define RB6_RP 38
# define RB6_AN 6
# define RB7_RP 39
# define RB7_AN 7
# define RB8_RP 40
# define RB8_AN 8
# define RB9_RP 41
# define RB9_AN 9
# define RB10_RP 42
# define RB10_AN 10
# define RB11_RP 43
# define RB11_AN 11
# define RB12_RP 44
# define RB12_AN 12
# define RB13_RP 45
# define RB13_AN 13
# define RB14_RP 46
# define RB14_AN 14
# define RB15_RP 47
# define RB15_AN 15
# define RC12_RP 60
# define RC13_RP 61
# define RC14_RP 62
# define RD0_RP 64
# define RD1_RP 65
# define RD2_RP 66
# define RD3_RP 67
# define RD4_RP 68
# define RD5_RP 69
# define RD6_RP 70
# define RD7_RP 71
# define RD8_RP 72
# define RD9_RP 73
# define RD10_RP 74
# define RD11_RP 75
# define RE0_RP 80
# define RE0_AN 24
# define RE1_RP 81
# define RE1_AN 25
# define RE2_RP 82
# define RE2_AN 26
# define RE3_RP 83
# define RE3_AN 27
# define RE4_RP 84
# define RE4_AN 28
# define RE5_RP 85
# define RE5_AN 29
# define RE6_RP 86
# define RE6_AN 30
# define RE7_RP 87
# define RE7_AN 31
# define RF0_RP 96
# define RF1_RP 97
# define RF2_RP 98
# define RF3_RP 99
# define RF4_RP 100
# define RF5_RP 101
# define RF6_RP 102
# define RG6_RP 118
# define RG7_RP 119
# define RG8_RP 120
# define RG9_RP 121

#elif defined(__PIC24F04KL100__) || \
      defined(__PIC24F08KL200__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_CN 0
# define RA6_CN 8
# define RB4_AN 15
# define RB4_CN 1
# define RB8_CN 22
# define RB9_CN 21
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24F04KL101__) || \
      defined(__PIC24F08KL201__) || \
      defined(__PIC24F08KL301__) || \
      defined(__PIC24F08KL401__) || \
      defined(__PIC24F16KA301__) || \
      defined(__PIC24F16KL401__) || \
      defined(__PIC24F32KA301__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_CN 0
# define RA6_CN 8
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB4_AN 15
# define RB4_CN 1
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24F08KA101__) || \
      defined(__PIC24F16KA101__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 4
# define RA2_CN 30
# define RA3_AN 5
# define RA3_CN 29
# define RA4_CN 0
# define RA6_CN 8
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_CN 6
# define RB4_CN 1
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_CN 11

#elif defined(__PIC24F08KA102__) || \
      defined(__PIC24F16KA102__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RA6_CN 8
# define RA7_CN 9
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB3_AN 5
# define RB3_CN 7
# define RB4_CN 1
# define RB5_CN 27
# define RB6_CN 24
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB10_CN 16
# define RB11_CN 15
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_CN 11

#elif defined(__PIC24F08KL302__) || \
      defined(__PIC24F08KL402__) || \
      defined(__PIC24F16KL402__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_CN 0
# define RA6_CN 8
# define RA7_CN 9
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB3_CN 7
# define RB4_AN 15
# define RB4_CN 1
# define RB6_CN 24
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB10_CN 16
# define RB11_CN 15
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24F08KM101__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_AN 16
# define RA4_CN 0
# define RA6_CN 8
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB4_AN 15
# define RB4_CN 1
# define RB7_AN 19
# define RB7_CN 23
# define RB8_AN 20
# define RB8_CN 22
# define RB9_AN 21
# define RB9_CN 21
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24F08KM102__) || \
      defined(__PIC24F08KM202__) || \
      defined(__PIC24F16KM102__) || \
      defined(__PIC24F16KM202__) || \
      defined(__PIC24F16KMX02__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_AN 16
# define RA4_CN 0
# define RA6_CN 8
# define RA7_CN 9
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB3_AN 5
# define RB3_CN 7
# define RB4_AN 15
# define RB4_CN 1
# define RB5_AN 17
# define RB5_CN 27
# define RB6_AN 18
# define RB6_CN 24
# define RB7_AN 19
# define RB7_CN 23
# define RB8_AN 20
# define RB8_CN 22
# define RB9_AN 21
# define RB9_CN 21
# define RB10_CN 16
# define RB11_CN 15
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

