lamlamngo/onewire-slave-emulator/lib/include/pic24_ports_mapping.h
#elif defined(__PIC24FJ128GA008__) || \
      defined(__PIC24FJ128GA010__) || \
      defined(__PIC24FJ64GA008__) || \
      defined(__PIC24FJ64GA010__) || \
      defined(__PIC24FJ96GA008__) || \
      defined(__PIC24FJ96GA010__)
# define RB0_AN 0
# define RB0_CN 2
# define RB1_AN 1
# define RB1_CN 3
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_AN 4
# define RB4_CN 6
# define RB5_AN 5
# define RB5_CN 7
# define RB6_AN 6
# define RB7_AN 7
# define RB8_AN 8
# define RB9_AN 9
# define RB10_AN 10
# define RB11_AN 11
# define RB12_AN 12
# define RB13_AN 13
# define RB14_AN 14
# define RB15_AN 15
# define RB15_CN 12
# define RC13_CN 1
# define RC14_CN 0
# define RD4_CN 13
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD13_CN 19
# define RD14_CN 20
# define RD15_CN 21
# define RF4_CN 17
# define RF5_CN 18
# define RG6_CN 8
# define RG7_CN 9
# define RG8_CN 10
# define RG9_CN 11

#elif defined(__PIC24FJ128GA110__) || \
      defined(__PIC24FJ192GA110__) || \
      defined(__PIC24FJ256GA110__) || \
      defined(__PIC24FJ64GA110__)
# define RA0_CN 33
# define RA1_CN 34
# define RA2_CN 35
# define RA3_CN 36
# define RA4_CN 37
# define RA5_CN 38
# define RA6_CN 39
# define RA7_CN 40
# define RA9_CN 41
# define RA10_CN 42
# define RA14_RP 36
# define RA14_CN 43
# define RA15_RP 35
# define RA15_CN 44
# define RB0_RP 0
# define RB0_AN 0
# define RB0_CN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB1_CN 3
# define RB2_RP 13
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_RP 28
# define RB4_AN 4
# define RB4_CN 6
# define RB5_RP 18
# define RB5_AN 5
# define RB5_CN 7
# define RB6_RP 6
# define RB6_AN 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_AN 7
# define RB7_CN 25
# define RB8_RP 8
# define RB8_AN 8
# define RB8_CN 26
# define RB9_RP 9
# define RB9_AN 9
# define RB9_CN 27
# define RB10_AN 10
# define RB10_CN 28
# define RB11_AN 11
# define RB11_CN 29
# define RB12_AN 12
# define RB12_CN 30
# define RB13_AN 13
# define RB13_CN 31
# define RB14_RP 14
# define RB14_AN 14
# define RB14_CN 32
# define RB15_RP 29
# define RB15_AN 15
# define RB15_CN 12
# define RC1_RP 38
# define RC1_CN 45
# define RC2_RP 39
# define RC2_CN 46
# define RC3_RP 40
# define RC3_CN 47
# define RC4_RP 41
# define RC4_CN 48
# define RC12_CN 23
# define RC13_CN 1
# define RC14_RP 37
# define RC14_CN 0
# define RC15_CN 22
# define RD0_RP 11
# define RD0_CN 49
# define RD1_RP 24
# define RD1_CN 50
# define RD2_RP 23
# define RD2_CN 51
# define RD3_RP 22
# define RD3_CN 52
# define RD4_RP 25
# define RD4_CN 13
# define RD5_RP 20
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD8_RP 2
# define RD8_CN 53
# define RD9_RP 4
# define RD9_CN 54
# define RD10_RP 3
# define RD10_CN 55
# define RD11_RP 12
# define RD11_CN 56
# define RD12_RP 42
# define RD12_CN 57
# define RD13_CN 19
# define RD14_RP 43
# define RD14_CN 20
# define RD15_RP 5
# define RD15_CN 21
# define RE0_CN 58
# define RE1_CN 59
# define RE2_CN 60
# define RE3_CN 61
# define RE4_CN 62
# define RE5_CN 63
# define RE6_CN 64
# define RE7_CN 65
# define RE8_RP 33
# define RE8_CN 66
# define RE9_RP 34
# define RE9_CN 67
# define RF0_CN 68
# define RF1_CN 69
# define RF2_RP 30
# define RF2_CN 70
# define RF3_RP 16
# define RF3_CN 71
# define RF4_RP 10
# define RF4_CN 17
# define RF5_RP 17
# define RF5_CN 18
# define RF6_RP 45
# define RF6_CN 72
# define RF7_RP 44
# define RF7_CN 73
# define RF8_RP 15
# define RF8_CN 74
# define RF12_RP 32
# define RF12_CN 75
# define RF13_RP 31
# define RF13_CN 76
# define RG0_CN 77
# define RG1_CN 78
# define RG2_CN 83
# define RG3_CN 84
# define RG6_RP 21
# define RG6_CN 8
# define RG7_RP 26
# define RG7_CN 9
# define RG8_RP 19
# define RG8_CN 10
# define RG9_RP 27
# define RG9_CN 11
# define RG12_CN 79
# define RG13_CN 80
# define RG14_CN 81
# define RG15_CN 82

#elif defined(__PIC24FJ128GA306__) || \
      defined(__PIC24FJ64GA306__)
# define RB0_RP 0
# define RB0_AN 0
# define RB0_CN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB1_CN 3
# define RB2_RP 13
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_RP 28
# define RB4_AN 4
# define RB4_CN 6
# define RB5_RP 18
# define RB5_AN 5
# define RB5_CN 7
# define RB6_RP 6
# define RB6_AN 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_AN 7
# define RB7_CN 25
# define RB8_RP 8
# define RB8_AN 8
# define RB8_CN 26
# define RB9_RP 9
# define RB9_AN 9
# define RB9_CN 27
# define RB10_AN 10
# define RB10_CN 28
# define RB11_AN 11
# define RB11_CN 29
# define RB12_AN 12
# define RB12_CN 30
# define RB13_AN 13
# define RB13_CN 31
# define RB14_RP 14
# define RB14_AN 14
# define RB14_CN 32
# define RB15_RP 29
# define RB15_AN 15
# define RB15_CN 12
# define RC12_CN 23
# define RC14_RP 37
# define RC15_CN 22
# define RD0_RP 11
# define RD0_CN 49
# define RD1_RP 24
# define RD1_CN 50
# define RD2_RP 23
# define RD2_CN 51
# define RD3_RP 22
# define RD3_CN 52
# define RD4_RP 25
# define RD4_CN 13
# define RD5_RP 20
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD8_RP 2
# define RD8_CN 53
# define RD9_RP 4
# define RD9_CN 54
# define RD10_RP 3
# define RD10_CN 55
# define RD11_RP 12
# define RD11_CN 56
# define RE0_CN 58
# define RE1_CN 59
# define RE2_CN 60
# define RE3_CN 61
# define RE4_CN 62
# define RE5_CN 63
# define RE6_CN 64
# define RE7_CN 65
# define RF0_CN 68
# define RF1_CN 69
# define RF2_RP 30
# define RF2_CN 70
# define RF3_RP 16
# define RF3_CN 71
# define RF4_RP 10
# define RF4_CN 17
# define RF5_RP 17
# define RF5_CN 18
# define RF6_CN 84
# define RG2_CN 72
# define RG3_CN 73
# define RG6_RP 21
# define RG6_CN 8
# define RG7_RP 26
# define RG7_CN 9
# define RG8_RP 19
# define RG8_CN 10
# define RG9_RP 27
# define RG9_CN 11

#elif defined(__PIC24FJ128GA308__) || \
      defined(__PIC24FJ64GA308__)
# define RA9_CN 41
# define RA10_CN 42
# define RA14_RP 36
# define RA14_CN 43
# define RA15_RP 35
# define RA15_CN 44
# define RB0_RP 0
# define RB0_AN 0
# define RB0_CN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB1_CN 3
# define RB2_RP 13
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_RP 28
# define RB4_AN 4
# define RB4_CN 6
# define RB5_RP 18
# define RB5_AN 5
# define RB5_CN 7
# define RB6_RP 6
# define RB6_AN 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_AN 7
# define RB7_CN 25
# define RB8_RP 8
# define RB8_AN 8
# define RB8_CN 26
# define RB9_RP 9
# define RB9_AN 9
# define RB9_CN 27
# define RB10_AN 10
# define RB10_CN 28
# define RB11_AN 11
# define RB11_CN 29
# define RB12_AN 12
# define RB12_CN 30
# define RB13_AN 13
# define RB13_CN 31
# define RB14_RP 14
# define RB14_AN 14
# define RB14_CN 32
# define RB15_RP 29
# define RB15_AN 15
# define RB15_CN 12
# define RC1_RP 38
# define RC1_CN 45
# define RC3_RP 40
# define RC3_CN 47
# define RC12_CN 23
# define RC14_RP 37
# define RC15_CN 22
# define RD0_RP 11
# define RD0_CN 49
# define RD1_RP 24
# define RD1_CN 50
# define RD2_RP 23
# define RD2_CN 51
# define RD3_RP 22
# define RD3_CN 52
# define RD4_RP 25
# define RD4_CN 13
# define RD5_RP 20
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD8_RP 2
# define RD8_CN 53
# define RD9_RP 4
# define RD9_CN 54
# define RD10_RP 3
# define RD10_CN 55
# define RD11_RP 12
# define RD11_CN 56
# define RD12_RP 42
# define RD12_CN 57
# define RD13_CN 19
# define RD14_RP 43
# define RD14_CN 20
# define RD15_RP 5
# define RD15_CN 21
# define RE0_CN 58
# define RE1_CN 59
# define RE2_CN 60
# define RE3_CN 61
# define RE4_CN 62
# define RE5_CN 63
# define RE6_CN 64
# define RE7_CN 65
# define RE8_RP 33
# define RE8_CN 66
# define RE9_RP 34
# define RE9_CN 67
# define RF0_CN 68
# define RF1_CN 69
# define RF2_RP 30
# define RF2_CN 70
# define RF3_RP 16
# define RF3_CN 71
# define RF4_RP 10
# define RF4_CN 17
# define RF5_RP 17
# define RF5_CN 18
# define RF6_CN 84
# define RF7_CN 83
# define RF8_RP 15
# define RF8_CN 74
# define RG0_CN 77
# define RG1_CN 78
# define RG2_CN 72
# define RG3_CN 73
# define RG6_RP 21
# define RG6_CN 8
# define RG7_RP 26
# define RG7_CN 9
# define RG8_RP 19
# define RG8_CN 10
# define RG9_RP 27
# define RG9_CN 11

#elif defined(__PIC24FJ128GA310__) || \
      defined(__PIC24FJ64GA310__)
# define RA0_CN 33
# define RA1_CN 34
# define RA2_CN 35
# define RA3_CN 36
# define RA4_CN 37
# define RA5_CN 38
# define RA6_AN 23
# define RA6_CN 39
# define RA7_AN 22
# define RA7_CN 40
# define RA9_CN 41
# define RA10_CN 42
# define RA14_RP 36
# define RA14_CN 43
# define RA15_RP 35
# define RA15_CN 44
# define RB0_RP 0
# define RB0_AN 0
# define RB0_CN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB1_CN 3
# define RB2_RP 13
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_RP 28
# define RB4_AN 4
# define RB4_CN 6
# define RB5_RP 18
# define RB5_AN 5
# define RB5_CN 7
# define RB6_RP 6
# define RB6_AN 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_AN 7
# define RB7_CN 25
# define RB8_RP 8
# define RB8_AN 8
# define RB8_CN 26
# define RB9_RP 9
# define RB9_AN 9
# define RB9_CN 27
# define RB10_AN 10
# define RB10_CN 28
# define RB11_AN 11
# define RB11_CN 29
# define RB12_AN 12
# define RB12_CN 30
# define RB13_AN 13
# define RB13_CN 31
# define RB14_RP 14
# define RB14_AN 14
# define RB14_CN 32
# define RB15_RP 29
# define RB15_AN 15
# define RB15_CN 12
# define RC1_RP 38
# define RC1_CN 45
# define RC2_RP 39
# define RC2_CN 46
# define RC3_RP 40
# define RC3_CN 47
# define RC4_RP 41
# define RC4_AN 16
# define RC4_CN 48
# define RC12_CN 23
# define RC14_RP 37
# define RC15_CN 22
# define RD0_RP 11
# define RD0_CN 49
# define RD1_RP 24
# define RD1_CN 50
# define RD2_RP 23
# define RD2_CN 51
# define RD3_RP 22
# define RD3_CN 52
# define RD4_RP 25
# define RD4_CN 13
# define RD5_RP 20
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD8_RP 2
# define RD8_CN 53
# define RD9_RP 4
# define RD9_CN 54
# define RD10_RP 3
# define RD10_CN 55
# define RD11_RP 12
# define RD11_CN 56
# define RD12_RP 42
# define RD12_CN 57
# define RD13_CN 19
# define RD14_RP 43
# define RD14_CN 20
# define RD15_RP 5
# define RD15_CN 21
# define RE0_CN 58
# define RE1_CN 59
# define RE2_CN 60
# define RE3_CN 61
# define RE4_CN 62
# define RE5_CN 63
# define RE6_CN 64
# define RE7_CN 65
# define RE8_RP 33
# define RE8_CN 66
# define RE9_RP 34
# define RE9_AN 21
# define RE9_CN 67
# define RF0_CN 68
# define RF1_CN 69
# define RF2_RP 30
# define RF2_CN 70
# define RF3_RP 16
# define RF3_CN 71
# define RF4_RP 10
# define RF4_CN 17
# define RF5_RP 17
# define RF5_CN 18
# define RF6_CN 84
# define RF7_CN 83
# define RF8_RP 15
# define RF8_CN 74
# define RF12_RP 32
# define RF12_CN 75
# define RF13_RP 31
# define RF13_CN 76
# define RG0_CN 77
# define RG1_CN 78
# define RG2_CN 72
# define RG3_CN 73
# define RG6_RP 21
# define RG6_AN 17
# define RG6_CN 8
# define RG7_RP 26
# define RG7_AN 18
# define RG7_CN 9
# define RG8_RP 19
# define RG8_AN 19
# define RG8_CN 10
# define RG9_RP 27
# define RG9_AN 20
# define RG9_CN 11
# define RG12_CN 79
# define RG13_CN 80
# define RG14_CN 81
# define RG15_CN 82

#elif defined(__PIC24FJ128GB106__) || \
      defined(__PIC24FJ192GB106__) || \
      defined(__PIC24FJ256GB106__) || \
      defined(__PIC24FJ64GB106__)
# define RB0_RP 0
# define RB0_AN 0
# define RB0_CN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB1_CN 3
# define RB2_RP 13
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_RP 28
# define RB4_AN 4
# define RB4_CN 6
# define RB5_RP 18
# define RB5_AN 5
# define RB5_CN 7
# define RB6_RP 6
# define RB6_AN 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_AN 7
# define RB7_CN 25
# define RB8_RP 8
# define RB8_AN 8
# define RB8_CN 26
# define RB9_RP 9
# define RB9_AN 9
# define RB9_CN 27
# define RB10_AN 10
# define RB10_CN 28
# define RB11_AN 11
# define RB11_CN 29
# define RB12_AN 12
# define RB12_CN 30
# define RB13_AN 13
# define RB13_CN 31
# define RB14_RP 14
# define RB14_AN 14
# define RB14_CN 32
# define RB15_RP 29
# define RB15_AN 15
# define RB15_CN 12
# define RC12_CN 23
# define RC13_CN 1
# define RC14_RP 37
# define RC14_CN 0
# define RC15_CN 22
# define RD0_RP 11
# define RD0_CN 49
# define RD1_RP 24
# define RD1_CN 50
# define RD2_RP 23
# define RD2_CN 51
# define RD3_RP 22
# define RD3_CN 52
# define RD4_RP 25
# define RD4_CN 13
# define RD5_RP 20
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD8_RP 2
# define RD8_CN 53
# define RD9_RP 4
# define RD9_CN 54
# define RD10_RP 3
# define RD10_CN 55
# define RD11_RP 12
# define RD11_CN 56
# define RE0_CN 58
# define RE1_CN 59
# define RE2_CN 60
# define RE3_CN 61
# define RE4_CN 62
# define RE5_CN 63
# define RE6_CN 64
# define RE7_CN 65
# define RF0_CN 68
# define RF1_CN 69
# define RF3_RP 16
# define RF3_CN 71
# define RF4_RP 10
# define RF4_CN 17
# define RF5_RP 17
# define RF5_CN 18
# define RG6_RP 21
# define RG6_CN 8
# define RG7_RP 26
# define RG7_CN 9
# define RG8_RP 19
# define RG8_CN 10
# define RG9_RP 27
# define RG9_CN 11

