lamlamngo/onewire-slave-emulator/lib/include/pic24_ports_mapping.h
#elif defined(__PIC24FJ16MC102__) || \
      defined(__PIC24FJ32MC102__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_RP 5
# define RB5_CN 27
# define RB6_RP 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB12_RP 12
# define RB12_CN 14
# define RB13_RP 13
# define RB13_CN 13
# define RB14_RP 14
# define RB14_CN 12
# define RB15_RP 15
# define RB15_CN 11

#elif defined(__PIC24FJ32GB002__) || \
      defined(__PIC24FJ64GB002__)
# define RA0_RP 5
# define RA0_AN 0
# define RA0_CN 2
# define RA1_RP 6
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_CN 27
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB13_RP 13
# define RB13_AN 11
# define RB13_CN 13
# define RB14_RP 14
# define RB14_AN 10
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24FJ32GB004__) || \
      defined(__PIC24FJ64GB004__)
# define RA0_RP 5
# define RA0_AN 0
# define RA0_CN 2
# define RA1_RP 6
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_CN 27
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB13_RP 13
# define RB13_AN 11
# define RB13_CN 13
# define RB14_RP 14
# define RB14_AN 10
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 9
# define RB15_CN 11
# define RC0_RP 16
# define RC0_AN 6
# define RC0_CN 8
# define RC1_RP 17
# define RC1_AN 7
# define RC1_CN 9
# define RC2_RP 18
# define RC2_AN 8
# define RC2_CN 10
# define RC3_RP 19
# define RC3_AN 12
# define RC3_CN 28
# define RC4_RP 20
# define RC4_CN 25
# define RC5_RP 21
# define RC5_CN 26
# define RC6_RP 22
# define RC6_CN 18
# define RC7_RP 23
# define RC7_CN 17
# define RC8_RP 24
# define RC8_CN 20
# define RC9_RP 25
# define RC9_CN 19

#elif defined(__PIC24FJ32MC104__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_AN 10
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_AN 9
# define RB4_CN 1
# define RB5_RP 5
# define RB5_CN 27
# define RB6_RP 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB12_RP 12
# define RB12_CN 14
# define RB13_RP 13
# define RB13_CN 13
# define RB14_RP 14
# define RB14_CN 12
# define RB15_RP 15
# define RB15_CN 11
# define RC0_RP 16
# define RC0_AN 6
# define RC0_CN 8
# define RC1_RP 17
# define RC1_AN 7
# define RC1_CN 9
# define RC2_RP 18
# define RC2_AN 8
# define RC2_CN 10
# define RC3_RP 19
# define RC3_AN 11
# define RC3_CN 28
# define RC4_RP 20
# define RC4_AN 12
# define RC4_CN 25
# define RC5_RP 21
# define RC5_AN 15
# define RC5_CN 26
# define RC6_RP 22
# define RC6_CN 18
# define RC7_RP 23
# define RC7_CN 17
# define RC8_RP 24
# define RC8_CN 20
# define RC9_RP 25
# define RC9_CN 19

#elif defined(__PIC24FV08KM102__) || \
      defined(__PIC24FV08KM202__) || \
      defined(__PIC24FV16KM102__) || \
      defined(__PIC24FV16KM202__)
# define RA1_AN 1
# define RB7_AN 19
# define RB7_CN 23
# define RB12_AN 12
# define RB12_CN 14

#elif defined(__PIC24FV08KM204__) || \
      defined(__PIC24FV16KM104__) || \
      defined(__PIC24FV16KM204__)
# define RA0_AN 0
# define RA0_CN 2
# define RB1_AN 3
# define RB1_CN 5
# define RB7_AN 19
# define RB7_CN 23
# define RB12_AN 12
# define RB12_CN 14

#elif defined(__PIC24FV16KA301__) || \
      defined(__PIC24FV32KA301__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_CN 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB4_AN 15
# define RB4_CN 1
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24FV16KA302__) || \
      defined(__PIC24FV32KA302__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_CN 0
# define RA7_CN 9
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB3_AN 5
# define RB3_CN 7
# define RB4_AN 15
# define RB4_CN 1
# define RB5_CN 27
# define RB6_CN 24
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB10_CN 16
# define RB11_CN 15
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24FV16KA304__) || \
      defined(__PIC24FV32KA304__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_AN 13
# define RA2_CN 30
# define RA3_AN 14
# define RA3_CN 29
# define RA4_CN 0
# define RA7_CN 9
# define RA8_CN 33
# define RA9_CN 34
# define RA10_CN 35
# define RA11_CN 36
# define RB0_AN 2
# define RB0_CN 4
# define RB1_AN 3
# define RB1_CN 5
# define RB2_AN 4
# define RB2_CN 6
# define RB3_AN 5
# define RB3_CN 7
# define RB4_AN 15
# define RB4_CN 1
# define RB5_CN 27
# define RB6_CN 24
# define RB7_CN 23
# define RB8_CN 22
# define RB9_CN 21
# define RB10_CN 16
# define RB11_CN 15
# define RB12_AN 12
# define RB12_CN 14
# define RB13_AN 11
# define RB13_CN 13
# define RB14_AN 10
# define RB14_CN 12
# define RB15_AN 9
# define RB15_CN 11
# define RC0_AN 6
# define RC0_CN 32
# define RC1_AN 7
# define RC1_CN 31
# define RC2_AN 8
# define RC2_CN 10
# define RC3_CN 28
# define RC4_CN 25
# define RC5_CN 26
# define RC6_CN 18
# define RC7_CN 17
# define RC8_CN 20
# define RC9_CN 19

