lamlamngo/onewire-slave-emulator/lib/include/pic24_ports_mapping.h
#elif defined(__PIC24FV16KMX02__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RB7_AN 19
# define RB7_CN 23
# define RB12_AN 12
# define RB12_CN 14

#elif defined(__PIC24FVKM08KM101__)
# define RB7_AN 19
# define RB7_CN 23
# define RB12_AN 12
# define RB12_CN 14

#elif defined(__PIC24HJ128GP206__) || \
      defined(__PIC24HJ128GP306__) || \
      defined(__PIC24HJ128GP506__) || \
      defined(__PIC24HJ256GP206__) || \
      defined(__PIC24HJ64GP206__) || \
      defined(__PIC24HJ64GP506__)
# define RB0_AN 0
# define RB0_CN 2
# define RB1_AN 1
# define RB1_CN 3
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_AN 4
# define RB4_CN 6
# define RB5_AN 5
# define RB5_CN 7
# define RB6_AN 6
# define RB7_AN 7
# define RB8_AN 8
# define RB9_AN 9
# define RB10_AN 10
# define RB11_AN 11
# define RB12_AN 12
# define RB13_AN 13
# define RB14_AN 14
# define RB15_AN 15
# define RB15_CN 12
# define RC1_AN 16
# define RC2_AN 17
# define RC13_CN 1
# define RC14_CN 0
# define RD4_CN 13
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RF4_CN 17
# define RF5_CN 18
# define RG6_CN 8
# define RG7_CN 9
# define RG8_CN 10
# define RG9_CN 11

#elif defined(__PIC24HJ128GP210__) || \
      defined(__PIC24HJ128GP310__) || \
      defined(__PIC24HJ128GP510__) || \
      defined(__PIC24HJ256GP210__) || \
      defined(__PIC24HJ256GP610__) || \
      defined(__PIC24HJ64GP210__) || \
      defined(__PIC24HJ64GP510__)
# define RA6_AN 22
# define RA6_CN 22
# define RA7_AN 23
# define RA7_CN 23
# define RA12_AN 20
# define RA13_AN 21
# define RB0_AN 0
# define RB0_CN 2
# define RB1_AN 1
# define RB1_CN 3
# define RB2_AN 2
# define RB2_CN 4
# define RB3_AN 3
# define RB3_CN 5
# define RB4_AN 4
# define RB4_CN 6
# define RB5_AN 5
# define RB5_CN 7
# define RB6_AN 6
# define RB7_AN 7
# define RB8_AN 8
# define RB9_AN 9
# define RB10_AN 10
# define RB11_AN 11
# define RB12_AN 12
# define RB13_AN 13
# define RB14_AN 14
# define RB15_AN 15
# define RB15_CN 12
# define RC1_AN 16
# define RC2_AN 17
# define RC3_AN 18
# define RC4_AN 19
# define RC13_CN 1
# define RC14_CN 0
# define RD4_CN 13
# define RD5_CN 14
# define RD6_CN 15
# define RD7_CN 16
# define RD13_CN 19
# define RD14_CN 20
# define RD15_CN 21
# define RE0_AN 24
# define RE1_AN 25
# define RE2_AN 26
# define RE3_AN 27
# define RE4_AN 28
# define RE5_AN 29
# define RE6_AN 30
# define RE7_AN 31
# define RF4_CN 17
# define RF5_CN 18
# define RG6_CN 8
# define RG7_CN 9
# define RG8_CN 10
# define RG9_CN 11

#elif defined(__PIC24HJ12GP201__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB4_RP 4
# define RB4_CN 1
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB14_RP 14
# define RB14_AN 7
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 6
# define RB15_CN 11

#elif defined(__PIC24HJ12GP202__)
# define RA0_AN 0
# define RA0_CN 2
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_RP 5
# define RB5_CN 27
# define RB6_RP 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB12_RP 12
# define RB12_AN 9
# define RB12_CN 14
# define RB13_RP 13
# define RB13_AN 8
# define RB13_CN 13
# define RB14_RP 14
# define RB14_AN 7
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 6
# define RB15_CN 11

#elif defined(__dsPIC33EP256MU806__)
# define RB0_RP 32
# define RB0_AN 0
# define RB1_RP 33
# define RB1_AN 1
# define RB2_RP 34
# define RB2_AN 2
# define RB3_RP 35
# define RB3_AN 3
# define RB4_RP 36
# define RB4_AN 4
# define RB5_RP 37
# define RB5_AN 5
# define RB6_RP 38
# define RB6_AN 6
# define RB7_RP 39
# define RB7_AN 7
# define RB8_RP 40
# define RB8_AN 8
# define RB9_RP 41
# define RB9_AN 9
# define RB10_RP 42
# define RB10_AN 10
# define RB11_RP 43
# define RB11_AN 11
# define RB12_RP 44
# define RB12_AN 12
# define RB13_RP 45
# define RB13_AN 13
# define RB14_RP 46
# define RB14_AN 14
# define RB15_RP 47
# define RB15_AN 15
# define RC12_RP 60
# define RC13_RP 61
# define RC14_RP 62
# define RD0_RP 64
# define RD1_RP 65
# define RD2_RP 66
# define RD3_RP 67
# define RD4_RP 68
# define RD5_RP 69
# define RD6_RP 70
# define RD7_RP 71
# define RD8_RP 72
# define RD9_RP 73
# define RD10_RP 74
# define RD11_RP 75
# define RE0_RP 80
# define RE0_AN 24
# define RE1_RP 81
# define RE1_AN 25
# define RE2_RP 82
# define RE2_AN 26
# define RE3_RP 83
# define RE3_AN 27
# define RE4_RP 84
# define RE4_AN 28
# define RE5_RP 85
# define RE5_AN 29
# define RE6_RP 86
# define RE6_AN 30
# define RE7_RP 87
# define RE7_AN 31
# define RF0_RP 96
# define RF1_RP 97
# define RF3_RP 99
# define RF4_RP 100
# define RF5_RP 101
# define RG6_RP 118
# define RG7_RP 119
# define RG8_RP 120
# define RG9_RP 121

#elif defined(__PIC24FJ256GA702__)
# define RA0_RP 26
# define RA0_AN 0
# define RA1_RP 27
# define RA1_AN 1
# define RB0_RP 0
# define RB0_AN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB2_RP 2
# define RB2_AN 4
# define RB3_RP 3
# define RB3_AN 5
# define RB4_RP 4
# define RB5_RP 5
# define RB6_RP 6
# define RB7_RP 7
# define RB8_RP 8
# define RB9_RP 9
# define RB10_RP 10
# define RB11_RP 11
# define RB12_RP 12
# define RB12_AN 8
# define RB13_RP 13
# define RB13_AN 7
# define RB14_RP 14
# define RB14_AN 6
# define RB15_RP 15
# define RB15_AN 9

#elif defined(__PIC24FJ256GA702__)
# define RA0_RP 26
# define RA0_AN 0
# define RA1_RP 27
# define RA1_AN 1
# define RB0_RP 0
# define RB0_AN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB2_RP 2
# define RB2_AN 4
# define RB3_RP 3
# define RB3_AN 5
# define RB4_RP 4
# define RB5_RP 5
# define RB6_RP 6
# define RB7_RP 7
# define RB8_RP 8
# define RB9_RP 9
# define RB10_RP 10
# define RB11_RP 11
# define RB12_RP 12
# define RB12_AN 8
# define RB13_RP 13
# define RB13_AN 7
# define RB14_RP 14
# define RB14_AN 6
# define RB15_RP 15
# define RB15_AN 9

#elif defined(__PIC24FJ256GA704__)
# define RA0_RP 26
# define RA0_AN 0
# define RA1_RP 27
# define RA1_AN 1
# define RA10_RP 28
# define RB0_RP 0
# define RB0_AN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB2_RP 2
# define RB2_AN 4
# define RB3_RP 3
# define RB3_AN 5
# define RB4_RP 4
# define RB5_RP 5
# define RB6_RP 6
# define RB7_RP 7
# define RB8_RP 8
# define RB9_RP 9
# define RB10_RP 10
# define RB11_RP 11
# define RB12_RP 12
# define RB12_AN 8
# define RB13_RP 13
# define RB13_AN 7
# define RB14_RP 14
# define RB14_AN 6
# define RB15_RP 15
# define RB15_AN 9
# define RC0_RP 16
# define RC0_AN 10
# define RC1_RP 17
# define RC1_AN 11
# define RC2_RP 18
# define RC2_AN 12
# define RC3_RP 19
# define RC3_AN 13
# define RC4_RP 20
# define RC5_RP 21
# define RC6_RP 22
# define RC7_RP 23
# define RC8_RP 24
# define RC9_RP 25

#elif defined(__PIC24FJ256GA705__)
# define RA0_RP 26
# define RA0_AN 0
# define RA1_RP 27
# define RA1_AN 1
# define RA10_RP 28
# define RA11_RP 29
# define RA12_RP 30
# define RA13_RP 31
# define RA14_RP 32
# define RB0_RP 0
# define RB0_AN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB2_RP 2
# define RB2_AN 4
# define RB3_RP 3
# define RB3_AN 5
# define RB4_RP 4
# define RB5_RP 5
# define RB6_RP 6
# define RB7_RP 7
# define RB8_RP 8
# define RB9_RP 9
# define RB10_RP 10
# define RB11_RP 11
# define RB12_RP 12
# define RB12_AN 8
# define RB13_RP 13
# define RB13_AN 7
# define RB14_RP 14
# define RB14_AN 6
# define RB15_RP 15
# define RB15_AN 9
# define RC0_RP 16
# define RC0_AN 10
# define RC1_RP 17
# define RC1_AN 11
# define RC2_RP 18
# define RC2_AN 12
# define RC3_RP 19
# define RC3_AN 13
# define RC4_RP 20
# define RC5_RP 21
# define RC6_RP 22
# define RC7_RP 23
# define RC8_RP 24
# define RC9_RP 25

#elif defined(__PIC24FJ256GA705__)
# define RA0_RP 26
# define RA0_AN 0
# define RA1_RP 27
# define RA1_AN 1
# define RA10_RP 28
# define RA11_RP 29
# define RA12_RP 30
# define RA13_RP 31
# define RA14_RP 32
# define RB0_RP 0
# define RB0_AN 2
# define RB1_RP 1
# define RB1_AN 1
# define RB2_RP 2
# define RB2_AN 4
# define RB3_RP 3
# define RB3_AN 5
# define RB4_RP 4
# define RB5_RP 5
# define RB6_RP 6
# define RB7_RP 7
# define RB8_RP 8
# define RB9_RP 9
# define RB10_RP 10
# define RB11_RP 11
# define RB12_RP 12
# define RB12_AN 8
# define RB13_RP 13
# define RB13_AN 7
# define RB14_RP 14
# define RB14_AN 6
# define RB15_RP 15
# define RB15_AN 9
# define RC0_RP 16
# define RC0_AN 10
# define RC1_RP 17
# define RC1_AN 11
# define RC2_RP 18
# define RC2_AN 12
# define RC3_RP 19
# define RC3_AN 13
# define RC4_RP 20
# define RC5_RP 21
# define RC6_RP 22
# define RC7_RP 23
# define RC8_RP 24
# define RC9_RP 25

#elif defined(__PIC24FJ128GB202__)
# define RA0_RP 5
# define RA0_AN 0
# define RA0_CN 2
# define RA1_RP 6
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_CN 27
# define RB6_RP 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB13_RP 13
# define RB13_AN 7
# define RB13_CN 13
# define RB14_RP 14
# define RB14_AN 6
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24FJ64GB202__)
# define RA0_RP 5
# define RA0_AN 0
# define RA0_CN 2
# define RA1_RP 6
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_CN 27
# define RB6_RP 6
# define RB6_CN 24
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB13_RP 13
# define RB13_AN 7
# define RB13_CN 13
# define RB14_RP 14
# define RB14_AN 6
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 9
# define RB15_CN 11

#elif defined(__PIC24FJ128GB204__) || \
      defined(__PIC24FJ64GB204__)
# define RA0_RP 5
# define RA0_AN 0
# define RA0_CN 2
# define RA1_RP 6
# define RA1_AN 1
# define RA1_CN 3
# define RA2_CN 30
# define RA3_CN 29
# define RA4_CN 0
# define RA7_CN 33
# define RA8_CN 34
# define RA9_CN 35
# define RA10_CN 36
# define RB0_RP 0
# define RB0_AN 2
# define RB0_CN 4
# define RB1_RP 1
# define RB1_AN 3
# define RB1_CN 5
# define RB2_RP 2
# define RB2_AN 4
# define RB2_CN 6
# define RB3_RP 3
# define RB3_AN 5
# define RB3_CN 7
# define RB4_RP 4
# define RB4_CN 1
# define RB5_CN 27
# define RB6_CN 24
# define RB7_RP 7
# define RB7_CN 23
# define RB8_RP 8
# define RB8_CN 22
# define RB9_RP 9
# define RB9_CN 21
# define RB10_RP 10
# define RB10_CN 16
# define RB11_RP 11
# define RB11_CN 15
# define RB13_RP 13
# define RB13_AN 7
# define RB13_CN 13
# define RB14_RP 14
# define RB14_AN 6
# define RB14_CN 12
# define RB15_RP 15
# define RB15_AN 9
# define RB15_CN 11
# define RC0_RP 16
# define RC0_AN 10
# define RC0_CN 8
# define RC1_RP 17
# define RC1_AN 11
# define RC1_CN 9
# define RC2_RP 18
# define RC2_AN 12
# define RC2_CN 10
# define RC3_RP 19
# define RC3_CN 28
# define RC4_RP 20
# define RC4_CN 25
# define RC5_RP 21
# define RC5_CN 26
# define RC6_RP 22
# define RC6_CN 18
# define RC7_RP 23
# define RC7_CN 17
# define RC8_RP 24
# define RC8_CN 20
# define RC9_RP 25
# define RC9_CN 19
#else
# error "Port information not defined."
#endif
